<div *ngIf="this.state === 'form'">
    <div class="text-gray-500 text-center fw-semibold fs-6 mb-20">
      <a routerLink="/auth" class="link-primary">
        {{ 'T.BACK' | translate }}
      </a>
    </div>

    <form class="form w-100" novalidate="novalidate" id="kt_login_signup_form" [formGroup]="form1"
      (ngSubmit)="submit()">
      <!--begin::Heading-->
      <div class="text-center mb-11">
        <!--begin::Title-->
        <h1 class="text-dark fw-bolder mb-3">
          İşletme Kaydı
        </h1>
        <!--end::Title-->

        <!--begin::Subtitle-->
        <div class="text-gray-500 fw-semibold fs-6">
          Müşterileriniz çevresine referans olsun diye dijital bir yol sunun böylece satın almaya hazır yeni müşteriler kazanın!
        </div>
        <!--end::Subtitle--->
      </div>
      <!--begin::Heading-->

      <!--begin::Login options-->
      <div class="row g-3 mb-9 flex-center" *ngIf="false">
        <!--begin::Col-->
        <div class="col-md-6">
          <!--begin::Google link--->
          <a href="#"
            class="btn btn-flex btn-outline btn-text-gray-700 btn-active-color-primary bg-state-light flex-center text-nowrap w-100">
            <img alt="Logo" src="./assets/media/svg/brand-logos/google-icon.svg" class="h-15px me-3" />
            Google ile giriş
          </a>
          <!--end::Google link--->
        </div>
        <!--end::Col-->

        <!--end::Col-->
      </div>
      <!--end::Login options-->

      <!--begin::Separator-->
      <div class="separator separator-content my-14" *ngIf="false"><span class="w-125px text-gray-500 fw-semibold fs-7">veya</span></div>
      <!--end::Separator-->

      <!--begin::Form group-->
      <div class="fv-row mb-8">
        <label class="form-label fw-bolder text-dark fs-6">Marka Adı</label>
        <input class="form-control bg-transparent" type="text" name="accountName" formControlName="accountName"
        [(ngModel)]="accountRegistrationService.accountData.name"
          placeholder="Marka" autocomplete="off" [ngClass]="{
            'is-invalid': form1.controls['accountName'].invalid,
            'is-valid': form1.controls['accountName'].valid
          }" />
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'required',
            message: 'İşletme adı gerekli',
            control: form1.controls['accountName']
          }"></ng-container>
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'minlength',
            message: 'İşletme adı en az 3 harfli olmalı',
            control: form1.controls['accountName']
          }"></ng-container>
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'maxLength',
            message: 'İşletme adı en fazla 100 harfli olmalı',
            control: form1.controls['accountName']
          }"></ng-container>
      </div>
      <!--end::Form group-->

      <!--begin::Form group-->
      <div class="fv-row mb-8">
        <label class="form-label fw-bolder text-dark fs-6">Adınız</label>
        <input class="form-control bg-transparent" type="text" name="firstName" formControlName="firstName"
        [(ngModel)]="accountRegistrationService.accountData.firstName"
          placeholder="Adınız" autocomplete="off" [ngClass]="{
            'is-invalid': form1.controls['firstName'].invalid,
            'is-valid': form1.controls['firstName'].valid
          }" />
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'required',
            message: 'Ad gerekli',
            control: form1.controls['firstName']
          }"></ng-container>
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'minlength',
            message: 'Adınız en az 3 harf olmalı',
            control: form1.controls['firstName']
          }"></ng-container>
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'maxLength',
            message: 'Adınız en fazla 100 harf olmalı',
            control: form1.controls['firstName']
          }"></ng-container>
      </div>
      <!--end::Form group-->

      <!--begin::Form group-->
      <div class="fv-row mb-8">
        <label class="form-label fw-bolder text-dark fs-6">Soyadınız</label>
        <input class="form-control bg-transparent" type="text" name="lastName" formControlName="lastName"
        [(ngModel)]="accountRegistrationService.accountData.lastName"
        placeholder="Soyadınız" autocomplete="off" [ngClass]="{
            'is-invalid': form1.controls['lastName'].invalid,
            'is-valid': form1.controls['lastName'].valid
          }" />
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'required',
            message: 'Soyad gerekli',
            control: form1.controls['lastName']
          }"></ng-container>
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'minlength',
            message: 'Soyad en az 3 harfli olmalı',
            control: form1.controls['lastName']
          }"></ng-container>
        <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'maxLength',
            message: 'Soyad en fazla 100 harfli olmalı',
            control: form1.controls['lastName']
          }"></ng-container>
      </div>
      <!--end::Form group-->

      <!--begin::Form group-->
      <div class="fv-row mb-8">
        <label class="form-label fw-bolder text-dark fs-6">Cep Telefonu</label>
        <div>
          <input class="form-control" type="tel" id="phoneNumber" name="phoneNumber" formControlName="phoneNumber"
            [(ngModel)]="accountRegistrationService.accountData.phoneNumber"
            [ngClass]="{
              'is-invalid': form1.controls['phoneNumber'].invalid,
              'is-valid': form1.controls['phoneNumber'].valid
            }">
          <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'required',
            message: 'Cep telefonu gerekli',
            control: form1.controls['phoneNumber']
          }"></ng-container>
          <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'minlength',
            message: 'Cep telefonu en az 10 karakter olmalı',
            control: form1.controls['phoneNumber']
          }"></ng-container>
        </div>
      </div>
      <!--end::Form group-->

      <!--begin::Form group-->
      <div class="fv-row mb-8">
        <label class="form-check form-check-inline">
          <input id="kt_login_toc_agree" type="checkbox" formControlName="agree" name="agree" class="form-check-input"
          [(ngModel)]="accountRegistrationService.accountData.agree"
          [ngClass]="{
            'is-invalid': form1.controls['agree'].invalid,
            'is-valid': form1.controls['agree'].valid
          }" />
          <span for="kt_login_toc_agree" class="form-check-label fw-semibold text-gray-700 fs-base">
          Yasalar olarak zorunlu olan <a (click)="switchState('gdpr')" href="javascript:;">Kişisel Verilerin Korunması Kanunu (KVKK)</a> aydınlatma metnini ve <a (click)="switchState('terms')" href="javascript:;">Kurallar ve Koşullar</a> metnini okudum ve kabul ediyorum
          </span>
          <ng-container [ngTemplateOutlet]="formError" [ngTemplateOutletContext]="{
            validation: 'required',
            message: 'Lütfen onaylayın',
            control: form1.controls['agree']
          }"></ng-container>
        </label>
      </div>
      <!--end::Form group-->

      <!--begin::Form group-->
      <div class="fv-row mb-8">
        <label class="form-check form-check-inline">
          <input id="kt_login_optin_agree" type="checkbox" formControlName="agreeOptin" name="agreeOptin" class="form-check-input" />
          <span for="kt_login_optin_agree" class="form-check-label fw-semibold text-gray-700 fs-base ms-1">
            Fırsatlardan ve gelişmelerden haberdar edilmek istiyorum
          </span>
        </label>
      </div>
      <!--end::Form group-->


      <!-- begin::Alert error-->
      <ng-container *ngIf="hasError">
        <div class="mb-lg-15 alert alert-danger">
          <div class="alert-text font-weight-bold">
            Kayıt yapılamadı
          </div>
        </div>
      </ng-container>
      <!-- end::Alert error-->

      <!--begin::Form group-->
      <div class="d-grid mb-10">
        <button type="submit" id="kt_sign_up_submit" [disabled]="
            form1.invalid || !form1.controls['agree'].value
          " class="btn btn-primary">

            {{'T.NEXT' | translate}}
            <span class="spinner-border spinner-border-sm align-middle ms-2" *ngIf="this.appService.isLoading$ | async"></span>
        </button>
      </div>
      <!--end::Form group-->


    </form>

    <ng-template #formError let-control="control" let-message="message" let-validation="validation">
      <ng-container *ngIf="control.hasError(validation) && (control.dirty || control.touched)">
        <div class="fv-plugins-message-container">
          <div class="fv-help-block">
            <span role="alert">
              {{ message }}
            </span>
          </div>
        </div>
      </ng-container>
    </ng-template>

</div>
<div *ngIf="this.state === 'gdpr'">
  <span style="padding-bottom: 40px; position: fixed; top: 20px; right: 20px; cursor: pointer;" (click)="switchState('form')">
    <i class="fa-solid fa-xmark fw-bolder" style="font-size: 30px;"></i>
  </span>
  <h4>Kişisel Verilerin Korunması Kanunu (KVKK) Hakkında Aydınlatma Metni</h4>

  <p>Son Güncelleme: 27.04.2024</p>

  <p>Agiletech London Ltd olarak şirketimiz&nbsp;i&ccedil;in muhataplarımızın (anlaşmalı işletmelerimiz, bu işletmelerden hizmet alan müşteriler ve müşterilerin referansıyla bilgi formunu dolduran potansiyel m&uuml;şteriler) &ouml;zel hayatlarına ilişkin gizliliğin korunması, bilgi g&uuml;venliğinin sağlanması ve korunması &ouml;ncelikli prensiplerimiz arasında yer almaktadır. Şirketimiz adına, siz değerli m&uuml;şterilerimizin g&uuml;venliğini g&ouml;z &ouml;n&uuml;nde bulundurarak, başta &ouml;zel hayatın gizliliği olmak &uuml;zere, temel hak ve &ouml;zg&uuml;rl&uuml;klerin korunması amacıyla, kişisel verilerle ilgili d&uuml;zenlenen "6698 sayılı Kişisel Verilerin Korunması Kanunu" hususunda sizi bilgilendirmek istiyoruz. Amacımız; sizlerin memnuniyeti doğrultusunda, kişisel verilerinizin alınma şekilleri, işlenme ama&ccedil;ları, hukuki nedenleri ve haklarınız konularında sizi en şeffaf şekilde bilgilendirmektir.</p>
  <p><strong>Kişisel Verilerin Toplanmasındaki Yasal Dayanak Nedir?&nbsp;</strong><br />7 Nisan 2016 tarihinde y&uuml;r&uuml;rl&uuml;ğe giren 6698 sayılı Kişisel Verilerin Korunması Kanunu (KVKK) gereğince,&nbsp;muhataplarımızın&nbsp;hizmetlerimizden faydalanabilmesi amacıyla, kişisel verilerini tarafımızla paylaşması halinde, şirketimiz; Veri Sorumlusu sıfatıyla, kişisel bilgileri kanunda a&ccedil;ıklandığı &ccedil;er&ccedil;evede; elde edebilecek, kaydedebilecek, muhafaza edebilecek,&nbsp;muhataplarla iletişime ge&ccedil;ebilecek,&nbsp;hizmetlerini devam ettirebilmek amacıyla bilgileri g&uuml;ncelleyebilecek, yeniden d&uuml;zenleyebilecek, mevzuatın izin verdiği durumlarda ve &ouml;l&ccedil;&uuml;de &uuml;&ccedil;&uuml;nc&uuml; kişilere a&ccedil;ıklayabilecek, devredebilecek, aktarabilecek, paylaşabilecek ve kanunda sayılan diğer şekillerde işleyebilecektir.</p>
  <p>Kişisel verilerinizin işlenme ama&ccedil;ları ve hukuki sebepleri; her t&uuml;rl&uuml; &uuml;r&uuml;n ve hizmetlerimizi sunabilmek ve kesintisiz olarak s&uuml;rd&uuml;rebilmek; işlem sahibinin bilgilerinin tespiti i&ccedil;in kimlik, adres ve diğer gerekli bilgilerini kaydetmek; elektronik veya k&acirc;ğıt ortamında işleme dayanak olacak t&uuml;m kayıt ve belgeleri d&uuml;zenlemek; yerel ve uluslararası mevzuat ve t&uuml;m otoritelerce &ouml;ng&ouml;r&uuml;len bilgi saklama, raporlama, bilgilendirme y&uuml;k&uuml;ml&uuml;l&uuml;klerine uymak, sizinle paylaşmamız gereken &ouml;nemli bilgileri iletişim bilgileriniz &uuml;zerinden iletmek; size &ouml;zel &uuml;r&uuml;n, hizmet, teklif faaliyetlerini planlamak ve hayata ge&ccedil;irmektir.</p>
  <p><strong>Kişisel Verileriniz Hangi Kanallardan Toplanır?&nbsp;</strong><br />Kişisel verileriniz mobil uygulamamız, internet sitemiz, &ccedil;ağrı merkezimiz ve benzeri diğer kanalları aracılığı ile otomatik ya da otomatik olmayan yollarla, yazılı, s&ouml;zl&uuml; ya da elektronik ortamda toplanabilmektedir.</p>
  <p><strong>Kişisel Verilerinizin Saklanması</strong></p>
  <p>Muhataplarımıza&nbsp;ait kişisel verilerin &uuml;&ccedil;&uuml;nc&uuml; kişiler ile paylaşımı,&nbsp;muhataplarımızın izni &ccedil;er&ccedil;evesinde ger&ccedil;ekleşmekte ve kural olarak&nbsp;muhatabımızın onayı olmaksızın kişisel verileri &uuml;&ccedil;&uuml;nc&uuml; kişilere aktarılmamaktadır.</p>
  <p>Bununla birlikte kişisel verileriniz, Kanun ve mevzuat h&uuml;k&uuml;mlerinin izin verdiği kişi, kurum ve kuruluşlar ve bunlarla sınırlı olmamak &uuml;zere diğer &uuml;&ccedil;&uuml;nc&uuml; kişilerle; BDDK, SPK, TCMB, MASAK, TBB, Hazine M&uuml;steşarlığı gibi otoritelerle; ortaklarımız ve doğrudan veya dolaylı yurti&ccedil;i, yurtdışı iştiraklerimiz ile t&uuml;m faaliyetlerimizi y&uuml;r&uuml;tmek amacıyla hizmet aldığımız, birlikte &ccedil;alıştığımız, işbirliği yaptığımız danışmanlar ve kuruluşlar ile paylaşılabilecektir.</p>
  <p>&Uuml;&ccedil;&uuml;nc&uuml; kişilere veri aktarımı sırasında hak ihlallerini &ouml;nlemek i&ccedil;in gerekli teknik ve hukuki &ouml;nlemler alınmaktadır. Bununla birlikte, kişisel verileri alan &uuml;&ccedil;&uuml;nc&uuml; kişinin veri koruma politikalarından dolayı ve &uuml;&ccedil;&uuml;nc&uuml; kişinin sorumluluğundaki risk alanında meydana gelen ihlallerden&nbsp;işletmemiz sorumlu değildir.</p>
  <p><strong>Kişisel Verilerinizin Korunması&nbsp;</strong><br />G&uuml;venlik politikalarımızda belirtildiği &uuml;zere; Şirketimiz, kişisel verilerin hukuka aykırı olarak işlenmesini &ouml;nlemek, kişisel verilere hukuka aykırı olarak erişilmesini &ouml;nlemek, kişisel verilerin muhafazasını sağlamak, amacıyla veri işleme faaliyetlerini y&uuml;r&uuml;t&uuml;rken uygun g&uuml;venlik d&uuml;zeyini temin etmeye y&ouml;nelik her t&uuml;rl&uuml; teknik ve idari tedbirleri almakla y&uuml;k&uuml;ml&uuml;d&uuml;r. Şirketimiz bu doğrultuda verilerinizin gizlilik, b&uuml;t&uuml;nl&uuml;k, erişilebilirlik ve g&uuml;venliğini sağlamak adına gerekli teknik ve idari almaktadır.</p>
  <p><strong>Kişisel Verilerin Korunması Kanundan Doğan Haklarınız Nelerdir?&nbsp;</strong><br />KVKK&rsquo; nın &ldquo;İstisnalar&rdquo; Başlıklı 28. Maddesinde &ouml;ng&ouml;r&uuml;len haller saklı kalmak kaydıyla, Kanun&rsquo;un 11. maddesi &ccedil;er&ccedil;evesinde şirketimize başvurarak kişisel verilerinizin;<br />1. İşlenip işlenmediğini, işlenme amacını ve amacına uygun kullanıp kullanılmadığı &ouml;ğrenme ve işlenmiş ise bu konuda bilgi isteme,<br />2. Kanun&rsquo;a uygun olarak yurt i&ccedil;inde ve yurt dışında bilgilerinizin paylaşıldığı &uuml;&ccedil;&uuml;nc&uuml; kişileri &ouml;ğrenme.<br />3. Bilgilerinizin eksik ya da hatalı işlendiğini d&uuml;ş&uuml;n&uuml;yorsanız d&uuml;zeltilmesini isteme,<br />4. Kanunun 7. maddesinde &ouml;ng&ouml;r&uuml;len şartlar &ccedil;er&ccedil;evesinde bilgilerinizin silinmesini ya da yok edilmesini talep etme,<br />5. Bilgilerinizin aktarıldığı &uuml;&ccedil;&uuml;nc&uuml; kişilere (c) ve (d) bentlerinde belirtilen taleplerinizin bildirilmesini ve aynı işlemleri ger&ccedil;ekleştirmelerini isteme,<br />6. Bilgilerinizin, otomatik sistemler ile analiz edilmesi nedeniyle aleyhinize bir sonucun ortaya &ccedil;ıkmasına itiraz etme veya kanuna aykırı olarak kaydedildiğini veya kullanıldığını d&uuml;ş&uuml;n&uuml;yorsanız ve bu sebeple zarara uğramışsanız zararın giderilmesini isteme, haklarına sahip olduğunuzu bilgilerinize sunarız.</p>
  <p>Haklarınızın, d&uuml;zenlemenin y&uuml;r&uuml;rl&uuml;k tarihi olan 07.10.2016 tarihinden itibaren kullanılması m&uuml;mk&uuml;n olup, taleplerinizin yerine getirilmesini teminen şirketimizce yapılacak masrafları, KVKK&rsquo; nın &ldquo;Veri sorumlusuna başvuru&rdquo; başlıklı 13. maddesinde belirtilen tarifeye g&ouml;re tarafınızdan talep etme hakkımız saklıdır.</p>
  <p><strong>Kişisel Verilerinizi Ne Kadar S&uuml;reyle Saklıyoruz?&nbsp;</strong><br />Mevzuat gereğince, şirketimizin m&uuml;şterileri ile ger&ccedil;ekleştirdiği işlemlere ilişkin kayıt ve belgeleri, 10 yıl s&uuml;re ile saklamasına dair yasal zorunluluk s&ouml;z konusudur. Kişisel verilerinizin silinmesini veya yok edilmesini talep etmeniz halinde, s&ouml;z konusu 10 yıllık s&uuml;renin sonunda bu talebiniz yerine getirilecektir. Bu s&uuml;re zarfında, kişisel verileriniz şirketimiz tarafından işlenmeyecek, ulusal ve uluslararası yasa, d&uuml;zenleme ve s&ouml;zleşmelerden kaynaklı zorunluluklar haricinde &uuml;&ccedil;&uuml;nc&uuml; kişiler ile paylaşılmayacak ve tarafınızla herhangi bir &uuml;r&uuml;n tanıtımı ya da pazarlaması i&ccedil;in bağlantıya ge&ccedil;ilmeyecektir.</p>
  <p><strong>Kişisel Verileriniz Hakkında Soru ve Talepleriniz mi Var?&nbsp;</strong><br />Kişisel Verilerinizin işlenmesi ile ilgili talep ve sorularınızı&nbsp;aşağıda belirtilen yollarla şirketimize bildirebilirsiniz. 6698 sayılı Kişisel Verilerin Korunması Kanunu 13&rsquo;&uuml;nc&uuml; maddesinin birinci fıkrası uyarınca; veri sorumlusu olan Şirketimize yapılacak başvuruların yazılı olarak veya Kişisel Verilerin Korunması Kurulu tarafından belirlenen diğer y&ouml;ntemlerle tarafımıza iletilmesi gerekmektedir. Bu &ccedil;er&ccedil;evede &ldquo;yazılı&rdquo; olarak Şirketimize yapılacak başvurular aşağıdaki y&ouml;ntemlerle yapılabilir:</p>
  <p>1.1. Başvuru Sahibi&rsquo;nin şahsen başvurusu ile,<br />1.2. Noter vasıtasıyla,<br />1.3. Başvuru Sahibi&rsquo;nce 5070 Sayılı Elektronik İmza Kanununda tanımlı olan &ldquo;g&uuml;venli elektronik imza&rdquo; ile imzalanarak Şirket kayıtlı elektronik posta adresine g&ouml;nderilmek suretiyle,<br />1.4.&nbsp;<a href="mailto:info@agiletechlondon.com">info@agiletechlondon.com</a>&nbsp;adresinden talep&nbsp;edebileceğiniz KVKK Formu ile&nbsp;<br />1.5. Aşağıdaki e-posta adresine g&ouml;nderilecek e-posta<br />1.6. Aşağıdaki fiziki posta adresine g&ouml;nderilecek imzalı posta veya kargo ile</p>
  <p><strong>Unvan:</strong>&nbsp;AgileTech London Ltd<br /><strong>E-posta adresi:</strong>&nbsp;info@agiletechlondon.com<br /><strong>Fiziki Posta adresi:</strong>&nbsp;1 Meridian South, Meridian Business Park, Leicester, England, LE19 1WY<br /><strong>Veri Sorumlusu:</strong> AGILETECH LONDON LTD</p>
</div>

<div *ngIf="this.state === 'terms'">
  <span style="padding-bottom: 40px; position: fixed; top: 20px; right: 20px; cursor: pointer;" (click)="switchState('form')">
    <i class="fa-solid fa-xmark fw-bolder" style="font-size: 30px;"></i>
  </span>
  <h4>KURALLAR ve KOŞULLAR</h4>
  <p>Son G&uuml;ncelleme: 11.05.2024</p>
  <p><strong>Ama&ccedil;</strong></p>
  <p><span style="font-weight: 400;">Recommed markası sağlık ve estetik sekt&ouml;r&uuml;ne &ouml;zel geliştirilmiş gelir paylaşımlı Referans Programı teknolojisidir. Ana amacı, kişilerin anlaşmalı işletmeleri tanıtarak ek gelir elde etmelerini sağlamaktır.</span></p>
  <p><strong>Taraflar</strong></p>
  <p><span style="font-weight: 400;">Anlaşmalı İşletme: Referans Programıyla yeni m&uuml;şteri edinmek isteyen işletme.</span></p>
  <p><span style="font-weight: 400;">Recommed: Anlaşmalı işletmelere teknoloji, danışmanlık ve &ccedil;ağrı merkezi hizmeti sunan işletme. Ticaret unvanı: AGILETECH LONDON LTD, 1 Meridian South, Meridian Business Park, Leicester, England, LE19 1WY.&nbsp;</span></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcı: Anlaşmalı işletmeden daha &ouml;nce hizmet almış ve &ccedil;evresine referans olarak ek gelir elde etmek isteyen kişi veya kurum.</span></p>
  <p><span style="font-weight: 400;">Potansiyel M&uuml;şteri: Referans Sağlayıcı'nın referansıyla işletmeden hizmet almak i&ccedil;in işletmeye başvuran kişiler.</span></p>
  <p><strong>Katılım Koşulları</strong></p>
  <p><span style="font-weight: 400;">Referans Programına dahil olabilmek i&ccedil;in T.C. vatandaşı olmak ve 18 yaşından g&uuml;n almış olmak yeterlidir.</span></p>
  <p><strong>Katılım Başlangıcı</strong></p>
  <p><span style="font-weight: 400;">Referans Programına katılım; kişinin Recommed mobil uygulamasını akıllı telefonuna ya da tabletine kurması, işbu kural ve koşulları kabul etmesi ile başlamış olur.</span></p>
  <p><strong>Katılım Değerlendirme S&uuml;reci</strong></p>
  <p><span style="font-weight: 400;">Referans Programına katılım yapan kişiler Referans Programı'nın sunduğu imk&acirc;nlardan faydalanmaya başlarlar. Recommed veya Anlaşmalı İşletme her katılımı kabul etmek zorunda olmayıp, sebep g&ouml;stermeksizin katılımları reddetme hakkına sahiptir.</span></p>
  <p><strong>Bildirim Kanalları</strong></p>
  <p>Recommed&rsquo;in Referans Programı hakkında bildirim ve duyuru yaptığı kanallar; Recommed mobil uygulaması, <a href="https://www.katilimevim.com.tr/">recommed.co</a> web sitesi, Referans Sağlayıcıların cep telefonlarına g&ouml;nderilen kısa mesajlar, bildirimler ve Recommed sosyal medya hesaplarıdır. Bu kanallardan yapılan bildirimler Referan Sağlayıcılar i&ccedil;in bağlayıcıdır. Recommed gelir bakiyesi ve program duyuruları da d&acirc;hil olmak &uuml;zere, her t&uuml;r bilgilendirmeyi sadece elektronik ortamdan duyurma ve yazılı formatta bildirim ve duyuru yapmama hakkını saklı tutar. Referans Sağlayıcılar bu kanallardan gelecek yeni bilgileri ve yapılan değişiklikleri takip etmekle y&uuml;k&uuml;ml&uuml;d&uuml;rler. Referans Sağlayıcıların&nbsp;bu bildirimleri takip etmiyor olmalarından Recommed veya anlaşmalı işletmeler sorumlu tutulamaz. Bu kanalların herhangi birinde yayınlanan yeni bilgilere veya mevcut bilgilerde yapılan değişikliklere Referans Sağlayıcıların&nbsp;24 saat i&ccedil;erisinde dilek&ccedil;e ile itiraz etme hakkı mevcuttur. İtiraz edilmemesi durumunda Referans Sağlayıcının yeni s&uuml;re&ccedil;lere aynen razı geldiği kabul edilecektir. Referans Sağlayıcılar, bildirimlerin her ne sebeple olursa olsun kendilerine ulaşmaması nedeniyle uğrayabilecekleri olası zararlardan dolayı, herhangi bir nam altında &ouml;deme veya sair taleplerde bulunamazlar.</p>
  <p><strong>&Ouml;d&uuml;l Kazanımı</strong></p>
  <p><span style="font-weight: 400;">Referans Programının performans değerlendirme ve hesaplama y&ouml;ntemi TL&rsquo;dir.</span></p>
  <p><span style="font-weight: 400;">Recommed &ouml;d&uuml;l sistemini herhangi bir zamanda değiştirme, bazı &ouml;d&uuml;l kazanım yollarını kaldırma, &ouml;d&uuml;l eksiltme/arttırma ve &ouml;d&uuml;l ekleme/&ccedil;ıkarma hakkını saklı tutar. Referans Sağlayıcılar, &ouml;d&uuml;l tablosunu Recommed&rsquo; in bildirim kanalları &uuml;zerinden takip etmekle y&uuml;k&uuml;ml&uuml;d&uuml;r.</span></p>
  <p><strong>&Ouml;d&uuml;l Kazanma Yolları</strong></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcılar aşağıdaki şekillerde &ouml;d&uuml;l kazanabilirler;</span></p>
  <ul>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Başlangı&ccedil; &ouml;d&uuml;lleri:&nbsp;</span><span style="font-weight: 400;">Uygulamayı kurmak, e</span><span style="font-weight: 400;">ğitim videosunu izlemek ve&nbsp;</span><span style="font-weight: 400;">ilk referansı kazandırmak şeklindedir.</span></li>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Referans Sağlayıcının referansıyla anlaşmalı işletmeye giden Potansiyel M&uuml;şterinin hizmet satın alması durumunda.</span></li>
  </ul>
  <p><strong>&Ouml;d&uuml;l Kazanım Şartları</strong></p>
  <ul>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Potansiyel M&uuml;şteri&rsquo;den tahsilat yapılmadığı s&uuml;rece Referans Sağlayıcı &ouml;d&uuml;l kazanamaz.</span></li>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Tahsilatın tutarında anlaşmalı işletmenin beyanı baz alınır.</span></li>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Tahsilatın taksitli olması durumunda Referans Sağlayıcının &ouml;d&uuml;lleri de taksitli olur.</span></li>
  </ul>
  <p><strong>Recommed &Ccedil;ağrı Merkezi</strong></p>
  <p><span style="font-weight: 400;">Potansiyel M&uuml;şteriler &ccedil;ağrı merkezi veya anlaşmalı işletme tarafından aranarak telefonla veya işletme lokasyonunda y&uuml;z y&uuml;ze bilgi almak isteyip istemedikleri sorulur.</span></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcının telefon rehberinden numara g&ouml;ndermesi durumunda anlaşmalı işletme veya &ccedil;ağrı merkezi bu numarayı arar. Referans Sağlayıcıların bir numarayı paylaşmadan &ouml;nce onları bilgilendirmeleri ve kendilerinden izin almaları zorunluluktur. </span></p>
  <p><strong>&Ouml;d&uuml;l İptali</strong></p>
  <p><span style="font-weight: 400;">Recommed veya anlaşmalı işletme iş bu s&ouml;zleşmedeki kurallara aykırı bir durum tespit ederse Referans Sağlayıcınin &ouml;d&uuml;llerini kısmet yada tamamen iptal edebilir, değiştirebilir veya Referans Sağlayıcıyı&nbsp;sistemden diskalifiye ederek online s&ouml;zleşmeyi edebilir.</span></p>
  <p><strong>&Ouml;d&uuml;llerin Ge&ccedil;erlilik S&uuml;resi</strong></p>
  <p><span style="font-weight: 400;">Referan sağlama sonucunda elde edilen &ouml;d&uuml;ller aksi belirtilmediği s&uuml;rece &ouml;d&uuml;l kazanıldığı g&uuml;nden itibaren 12 ay s&uuml;re ile ge&ccedil;erlidir. Bu s&uuml;re&ccedil;te işletmeden &ouml;demesi alınmayan &ouml;d&uuml;ller geri d&ouml;n&uuml;lmez şekilde iptal edilir.</span></p>
  <p><strong>Fesih Halinde &Ouml;d&uuml;llerin Ge&ccedil;erliliği</strong></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcı, Recommed veya anlaşmalı işletme tarafından ihbar verilmek suretiyle fesih edilmesi hallerinde, &ouml;d&uuml;llerin ge&ccedil;erliliği konusunda kısıtlama getirilen sair d&uuml;zenlemeler saklı kalmak kaydıyla, fesih sonrasında ge&ccedil;erli olmaya devam eder. Potansiyel m&uuml;şteriden tahsilat yapılmadan Referans Sağlayıcı başlangı&ccedil; &ouml;d&uuml;llerinin &ouml;denmesini talep edemez. Fesih nedeninin &ldquo;K&ouml;t&uuml;ye Kullanım&rdquo; nedeniyle olması durumunda Recommed veya anlaşmalı işletmeleri &ouml;d&uuml;lleri iptal etme hakkını da saklı tutar.</span></p>
  <p><strong>&Ouml;d&uuml;l Kazanım Hareketleri</strong></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcılar kişisel &ouml;d&uuml;l kazanım hareketleriyle ilgili detaylara Recommed Mobil Uygulaması aracılığı ile ulaşabilirler.</span></p>
  <p><strong>&Ouml;d&uuml;llerin &Ouml;demesi</strong></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcılara &ouml;demeler Recommed tarafından yapılır. Recommed anlaşmalı işletmeye komisyon tutarını da i&ccedil;eren fatura keser. Recommed &ouml;demeyi aldığında 5 iş g&uuml;n&uuml; i&ccedil;erisinde Referans Sağlayıcıya &ouml;deme yapmayı kabul ve taahh&uuml;t eder. İşletme bu &ouml;demeyi yapmadığı s&uuml;rece Recommed ilgili Referans Sağlayıcıya &ouml;deme yapmaz.</span></p>
  <p><strong>&Ouml;deme Takvimi</strong></p>
  <ul>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Referans Sağlayıcılarına &ouml;demeler her ay, ayda yalnızca 1 defa yapılır. &Ouml;deme g&uuml;n&uuml; Recommed tarafından bildirim kanalları &uuml;zerinden duyurulur.</span></li>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Referans Sağlayıcı başka bir kişinin banka hesabına &ouml;deme yapılmasını isteyebilir. Bu durumda banka hareketindeki a&ccedil;ıklamada ge&ccedil;en isim baz alınır.</span></li>
  </ul>
  <p><strong>Fesih, Askıya Alma, Referans Sağlayıcılığı Yetkilerinin Sona Ermesi</strong></p>
  <p>Recommed, Referans Sağlayıcı ile olan iş ilişkisini herhangi bir sebep g&ouml;stermeksizin feshetme hakkına sahiptir. Referans Sağlayıcı aynı şekilde istediği an herhangi bir ihbar s&uuml;resine uymaksızın &ccedil;ağrı merkezini arayarak yada mobil uygulamayı kullanarak Referans Programından ayrılma talebi iletebilir.</p>
  <p>Recommed aşağıdaki durumların varlığı halinde Referans Sağlayıcının kaydını askıya alabilir. Askıya alma hakkı, aşağıdaki hallerin varlığı hususunda kuvvetli ş&uuml;phelerin olması halinde de mevcut olup, araştırma s&uuml;resince devam eder. Bu hallerin varlığı durumunda Recommed, her t&uuml;r diğer tazminat ve dava hakkı saklı kalmak kaydıyla herhangi bir feshi ihbar s&uuml;resine uymaksızın, Referans Sağlayıcılığını derhal feshedebilir ve bu durumda hesaptaki &ouml;d&uuml;ller ve diğer y&uuml;k&uuml;ml&uuml;l&uuml;kler i&ccedil;in sorumlu olmaz.</p>
  <ul>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Referans Sağlayıcının yanlış bilgi vermesi, kurallara ve kanuna aykırı şekilde faydalanması,</span></li>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Referans Sağlayıcının referans olduğu kişilerin &ccedil;oğunluğunun bilgi almayı istememesi ("kalitesiz referans")</span></li>
  <li style="font-weight: 400;"><span style="font-weight: 400;">Referans Sağlayıcınin; Recommed veya anlaşmalı işletme markası, Recommed personeli veya anlaşmalı işletme personeli, diğer Referans Sağlayıcılar, &Ccedil;ağrı Merkezi veya potansiyel m&uuml;şterilere karşı s&ouml;zl&uuml; ya da fiili saldırıda bulunması, sataşması, tacizde bulunması, herhangi bir d&ouml;nemde Recommed personellerinin talimatlarına aykırı davranması durumunda Referans Sağlayıcılığı Recommed tarafından tek taraflı olarak feshedilir.</span></li>
  </ul>
  <p><span style="font-weight: 400;">Bu haller nedeniyle Recommed tarafından ilişkisi sona erdirilen Referans Sağlayıcılar yeni &ouml;d&uuml;l kazanamazlar ve kazanabilecekleri olası &ouml;d&uuml;ller ge&ccedil;ersizdir.</span></p>
  <p><strong>Kayıtların Ge&ccedil;erliliği</strong></p>
  <p><span style="font-weight: 400;">İşbu genel kural ve koşullara bağlı olarak Recommed, Referans Programı hesaplarının idaresi, işlenen &ouml;d&uuml;llerin hesaplanması ve &ouml;deme bilgilerinin hazırlanmasıyla &ouml;demelerin yapılması ve icrası konusunda tek yetkili olup, programdaki performans değerlendirmesi konusunda da Recommed kayıtları ge&ccedil;erli sayılacaktır.</span></p>
  <p><strong>Referans Sağlayıcı Hesabı ve Kazan&ccedil;lar</strong></p>
  <p><span style="font-weight: 400;">Her Referans Sağlayıcıya, aktivitelerini ve kazandığı &ouml;d&uuml;lleri g&ouml;r&uuml;nt&uuml;leyebildiği kişisel bir "Referans Sağlayıcı Hesabı" tanımlanır. &Ouml;d&uuml;ller başka Referans Sağlayıcılarına devredilemez ve birleştirilemez. Recommed ve anlaşmalı işletmelerin, &ouml;d&uuml;llerin kullanım koşullarının belirlenmesi konusunda her t&uuml;r tasarruf hakkını saklı tutar.</span></p>
  <p><span style="font-weight: 400;">Referans Sağlayıcının vefatı halinde &ouml;l&uuml;m ilanı, verasetname ve diğer varislerin haklarından feragat ettiklerini g&ouml;steren noter tasdikli feragatnamenin Recommed&rsquo; e ibraz edilmesi durumunda varislerden birine vefat eden Referans Sağlayıcının &ouml;d&uuml;lleri transfer edilir. Transfer edilen &ouml;d&uuml;ller ilk kazanıldıkları tarih itibarıyle ge&ccedil;erlidir.</span></p>
  <p><strong>Yasal İtirazlar</strong></p>
  <p><span style="font-weight: 400;">Recommed, Referans Sağlayıcının &ouml;d&uuml;l bakiyesi ve program katılımı konusundaki itirazların değerlendirilmesiyle, &ouml;d&uuml;le hak kazanıp kazanmadığını belirleyecek tek yetkili olup, &ouml;d&uuml;l&uuml;n Referans Sağlayıcının hesabına yanlış bir şekilde kaydedildiği kanaatine varırsa kaydedilen &ouml;d&uuml;l&uuml; iptal etme veya yeni &ouml;d&uuml;llerin kaydedilmesine engel olma hakkını saklı tutar. Recommed yanlış yapılan hesaplar neticesinde Referans Sağlayıcının hesabına yapılan olası &ouml;demeler karşılığında Referans Sağlayıcının&nbsp;bor&ccedil;landırma veya zararının giderimi i&ccedil;in diğer yasal yollara başvurma hakkını saklı tutar.</span></p>
  <p><strong>K&ouml;t&uuml;ye Kullanım</strong></p>
  <p><span style="font-weight: 400;">İşbu kural ve koşulları ihlal eden, imkanlarını k&ouml;t&uuml;ye kullanan veya aktiviteleriyle ilgili yanlış bilgi vererek avantaj elde etme girişiminde bulunan Referans Sağlayıcılar, bu t&uuml;r eylemlerinden dolayı yargısal cezalara maruz kalma, tazminat &ouml;deme, Recommed tarafından Referans Sağlayıcı yetkilerine son verilmesi ve o zamana kadar toplamış oldukları &ouml;d&uuml;llerin ge&ccedil;ersiz sayılması gibi m&uuml;eyyidelerle karşılaşabilir. Referans Sağlayıcıların haksız TL &ouml;demesi almaları halinde, aynı tutarın iadesi m&uuml;eyyidesi uygulanır. Recommed, bakiye zararlarını tazmin etme hakkını saklı tutar.</span></p>
  <p><strong>Vergi ve Har&ccedil;lar</strong></p>
  <p><span style="font-weight: 400;">Recommed, m&uuml;şterilerinin ve &uuml;&ccedil;&uuml;nc&uuml; tarafların Referans Programı dolayısı ile kazandıkları TL &ouml;demelerine ilişkin olarak tabi oldukları vergi ve har&ccedil;larla, ekstra &uuml;cretlerle ilgili hi&ccedil;bir sorumluluk kabul etmez.</span></p>
  <p><strong>Değişiklik Hakkı ve Sorumluluğun Sınırlandırılması</strong></p>
  <p><span style="font-weight: 400;">Recommed, Referans Programını ve/veya program kapsamındaki ortak kuruluşlarla ve &ccedil;&ouml;z&uuml;m ortaklarıyla olan iş birliğini istediği zaman tamamen veya kısmen değiştirme ya da y&uuml;r&uuml;rl&uuml;kten kaldırma hakkını saklı tutar. Recommed, bildirim kanalları &uuml;zerinden değişiklikleri duyurduktan sonra bu kurallar b&uuml;t&uuml;n Referans Sağlayıcılar i&ccedil;in bağlayıcı olacaktır. Bu nedenle, Referans Sağlayıcının &ouml;d&uuml;l kazanması, kazanılmış bir hak olarak beyan edilemez. Recommed hep aynı tarihte &ouml;demenin yapılacağını garanti etmez. Referans Programındaki her t&uuml;r tasarruf yetkisi m&uuml;nhasıran Recommed&rsquo;e aittir. Recommed&rsquo; in bu program kapsamında kendisine tanınan herhangi bir hakkını kullanmaması veya Referans Sağlayıcının program koşullarından herhangi birine uymasını talep etmemesi veya program haklarını kullanmadaki gecikmeler veya aksine fiili uygulamalarla program prensiplerine aykırı d&ouml;nemsel &ouml;d&uuml;l uygulamalarıyla Referans Sağlayıcılara tanınmış d&ouml;nemsel ek haklar, Recommed&rsquo; in programdaki tasarruf hakkından veya Referans Sağlayıcının uymakla y&uuml;k&uuml;ml&uuml; olduğu kurallardan herhangi birine veya tamamına uymasını talep hakkından feragat ettiği anlamına gelmeyeceği gibi, Referans Sağlayıcı bakımından istisnai uygulamanın Referans Sağlayıcıya&nbsp;ve diğer kişilere ek bir hak getirdiği, program prensiplerinin değiştirildiği ve benzer uygulamalara emsal teşkil edeceği anlamına gelmez. İşbu program koşullarının ihlali durumunda sorumluluk, oluşan doğrudan maddi zararlarla sınırlı olup, dolaylı maddi-manevi zararlar bakımından Recommed hi&ccedil;bir sorumluluk kabul etmez.</span></p>
  <p><strong>Hukuki Şartlar</strong></p>
  <p><span style="font-weight: 400;">İşbu Referans Programının yorumu, uygulanması ve ihtilafların &ccedil;&ouml;z&uuml;m&uuml; T&uuml;rkiye Cumhuriyeti kanunlarına tabi olup uyuşmazlıkların &ccedil;&ouml;z&uuml;m&uuml;nde İstanbul Anadolu Mahkemeleri ve İcra Daireleri yetkilidir. Ancak Recommed&rsquo; in kanunda belirtilen diğer yetkili mahkemelerde de dava a&ccedil;ma hakkı saklıdır.</span></p>
  <p><strong>AGILETECH LONDON LTD<br />1 Meridian South, Meridian Business Park, Leicester, England, LE19 1WY<br /><br /></strong></p>
</div>

